'''
Однажды я попросил, чтобы студенты ответили на два вопроса анкеты «ваш год рождения» и «ваш возраст».
Из их ответов я сформировал таблицу, в которой был столбец Р=«год рождения студента» и Q=«возраст студента».
Оказывается, значение коэффициента корреляции признаков P и Q зависит от месяца, в котором проводилось анкетирование (это не шутка!). Укажите два месяца, которым соответствует наименьшее (по модулю) значение коэффициента корреляции признаков P и Q.
'''

'''
[
    [[2003, 2002, 2002, 2004, 2008, 2004, 2008, 2002, 2009, 2003, 2007, 2006], [19, 19, 19, 17, 13, 17, 13, 19, 12, 18, 14, 15]],
    [[2003, 2002, 2002, 2004, 2008, 2004, 2008, 2002, 2009, 2003, 2007, 2006], [19, 20, 19, 17, 13, 17, 13, 19, 12, 18, 14, 15]],
    [[2003, 2002, 2002, 2004, 2008, 2004, 2008, 2002, 2009, 2003, 2007, 2006], [19, 20, 20, 17, 13, 17, 13, 19, 12, 18, 14, 15]],
    [[2003, 2002, 2002, 2004, 2008, 2004, 2008, 2002, 2009, 2003, 2007, 2006], [19, 20, 20, 18, 13, 17, 13, 19, 12, 18, 14, 15]],
    [[2003, 2002, 2002, 2004, 2008, 2004, 2008, 2002, 2009, 2003, 2007, 2006], [19, 20, 20, 18, 14, 17, 13, 19, 12, 18, 14, 15]],
    [[2003, 2002, 2002, 2004, 2008, 2004, 2008, 2002, 2009, 2003, 2007, 2006], [19, 20, 20, 18, 14, 18, 13, 19, 12, 18, 14, 15]],
    [[2003, 2002, 2002, 2004, 2008, 2004, 2008, 2002, 2009, 2003, 2007, 2006], [19, 20, 20, 18, 14, 18, 14, 19, 12, 18, 14, 15]],
    [[2003, 2002, 2002, 2004, 2008, 2004, 2008, 2002, 2009, 2003, 2007, 2006], [19, 20, 20, 18, 14, 18, 14, 20, 12, 18, 14, 15]],
    [[2003, 2002, 2002, 2004, 2008, 2004, 2008, 2002, 2009, 2003, 2007, 2006], [19, 20, 20, 18, 14, 18, 14, 20, 13, 18, 14, 15]],
    [[2003, 2002, 2002, 2004, 2008, 2004, 2008, 2002, 2009, 2003, 2007, 2006], [19, 20, 20, 18, 14, 18, 14, 20, 13, 19, 14, 15]],
    [[2003, 2002, 2002, 2004, 2008, 2004, 2008, 2002, 2009, 2003, 2007, 2006], [19, 20, 20, 18, 14, 18, 14, 20, 13, 19, 15, 15]],
    [[2003, 2002, 2002, 2004, 2008, 2004, 2008, 2002, 2009, 2003, 2007, 2006], [19, 20, 20, 18, 14, 18, 14, 20, 13, 19, 15, 16]]
]
'''


from random import random
import pandas as pd
import numpy as np
years = list((2000 + int(random() * 10) for _ in range(12)))
table = []
# 12 month
for i in range(12):
    # 12 people, sorted by birthday
    ages = []
    for j in range(12):
        age = 2021 - years[j]
        if i >= j:
            age += 1
        ages.append(age)
    table.append([years, ages])


def average(array):
    return sum(array) / len(array)


# отклонение
def sp(array):
    avr = average(array)
    s = 0

    for v in array:
        s += (v - avr) ** 2

    return (s / (len(array) - 1)) ** 0.5


# коэф корреляции
def rPQ(P, Q):
    n = len(P)
    sumPiQi = 0
    for i in range(n):
        sumPiQi += P[i] * Q[i]

    avP = average(P)
    avQ = average(Q)
    nAvPAvQ = n * avP * avQ

    top = sumPiQi - nAvPAvQ
    bottom = (n - 1) * sp(P) * sp(Q)

    return top / bottom


'''
byMonth
[
    -0.995682723737927,
    -0.9913478882752157,
    -0.989211664910821,
    -0.989157521267911,
    -0.9869250313727403,
    -0.9856268313020333,
    -0.985068840851293,
    -0.9865310200195563,
    -0.9884698276994729,
    -0.9913956164905763,
    -0.9955909521492406,
    -1.000000000000201
]
byMonthPandas
[
    -0.995682723737926,
    -0.9913478882754163,
    -0.989211664910625,
    -0.9891575212679097,
    -0.9869250313729299,
    -0.9856268313018379,
    -0.9850688408512913,
    -0.9865310200197637,
    -0.9884698276992634,
    -0.9913956164905737,
    -0.9955909521494349,
    -0.9999999999999988
]
'''


def main():
    print('table', table)

    byMonth = []
    byMonthPandas = []
    for i in range(12):
        r = rPQ(table[i][0], table[i][1])
        byMonth.append(r)

        df = pd.DataFrame(data={'years': table[i][0], 'ages': table[i][1]})
        rPandas = df.corr(method='pearson')
        byMonthPandas.append(rPandas.ages.years)

    print('byMonth', byMonth)
    print('byMonthPandas', byMonthPandas)


if __name__ == '__main__':
    main()
