'''
Объекты в следующей таблице имеют два нецелевых признака Х1, Х2.
Проблема в том, что существует сильная (даже линейная) зависимость между признаками X1, X2.
Построим модель линейной регрессии с регуляризацией для предсказания признака Y (значение константы регуляризации С положить равным 1).
Полученная модель будет иметь вид: Y = ... Х1 + ... Х2 + ...
(найденные значения округлить до двух знаков после запятой).
    X1  X2  Y
A   0   3   0
B   1   2   1
C   2   1   0
D   3   0   3
'''

'''
w1*x1 + w2*x2 + w0 - y
'''