'''
L(w1,w0) = (w1*-1 + w0 - 1)^2 + (w1*0 + w0 - 0)^2 + (w1*1 + w0 - 1)^2 + (w1*2 + w0 - 4)^2 =
(w1^2 + w0^2 + 1 - 2w1w0 - 2w0 + 2w1) + (0 + w0^2 + 0 + 2*0 - 2*0 - 2*0) + (w1^2 + w0^2 + 1 + 2w1w0 - 2w0 - 2w1) + (4w1^2 + w0^2 + 16 + 4w1w0 - 8w0 - 16w1) =
6w1^2 + 4w0^2 + 18 + 4w1w0 - 12w0 - 16w1
Вычисляем частные производные:
Каждую переменную назначаем константой и получаем производные

12w1 + 4w0 - 16
8w0 + 4w1 - 12

приравниваем к 0:
12w1 + 4w0 - 16 = 0
4w1 + 8w0 - 12 = 0

12w1 + 4w0 - 16 = 0
12w1 + 24w0 - 36 = 0

20w0 - 20 = 0
w0 = 1

должно получиться
y' = w1*x1 + w0
y' = x + 1


Объекты в следующей таблице имеют один нецелевой признак Х.
Построим модель линейно регрессии для предсказания признака Y.
x   y
0   0
1   1
2   0
3   3
Внутри скобок - 3 слагаемых w1*X + w0 + (-Y)

L(w1,w0) = (w1*0 + w0 - 0)^2 + (w1*1 + w0 - 1)^2 + (w1*2 + w0 - 0)^2 + (w1*3 + w0 - 3)^2 =
(w0^2) + (w1^2 + w0^2 + 1 + 2w1w0 - 2w0 - 2w1) + (4w1^2 + w0^2 + 4w1w0) + (9w1^2 + w0^2 + 9 + 6w1w0 - 6w0 - 18w1) =
14w1^2 + 4w0^2 + 12w1w0 - 8w0 - 20w1 + 10

28w1 + 12w0 - 20 = 0
8w0 + 12w1 - 8 = 0

56w1 + 24w0 - 40 = 0
36w1 + 24w0 - 24 = 0

20w1 - 16 = 0

5w1 = 4
w1 = 0.8

28 * 0.8 + 12w0 - 20 = 22.4 - 20 + 12w0 = 2.4 + 12w0 = 0
w0 = -0.2

-0.2*8 + 12*0.8 - 8
-1.6 + 9.6 - 8 = 0

y' = 0.8*x - 0.2
'''

'''
Чему равна частная производная функции
f(x,y)=2x2 -3xy+4y2-2x+y+10 по переменной x?
f(x,y)=2*x^2 - 3xy + 4*y^2 - 2x + y + 10 по переменной x?
4x - 3y - 2

'''
