'''
Дана функция f(u,v) = u^2 - 2v^2 - 2u + 4v + 1

Ее градиент в точке (0,0) равен (... , ...). Будем искать точку минимума с помощью метода градиентного спуска. Длину шага полагаем равной 0,5. В какую точку мы попадем из точки (0,0) после одной итерации метода градиентного спуска? Ответ: (... , ...).

(2u - 2, -4v + 4)
(0, 0)
(-2, 4) - самая высокая точка, нужно идти в обратном направлении
(2, -4)
(0, 0) + 0.5(2, -4) = (1, -2)
'''

'''
Чему равен градиент функции f(u,v)= u*v + 1 в точке (1, 2)?
(v, u)
(2, 1)
'''












